### **Handle Categorical Features**
### **One Hot Encoding**

In [1]:
import pandas as pd

In [10]:
url = "https://raw.githubusercontent.com/krishnaik06/Feature-Engineering-Live-sessions/master/titanic.csv"
df = pd.read_csv(url, usecols=['Sex'])

In [11]:
df.head(20)

       Sex
0     male
1   female
2   female
3   female
4     male
5     male
6     male
7     male
8   female
9   female
10  female
11  female
12    male
13    male
14  female
15  female
16    male
17    male
18  female
19  female

Creating dummy variables for categories present into the feature

In [13]:
pd.get_dummies(df, drop_first=True).head() # drop_first=True first feature will be dropped and last feature will be used

   Sex_male
0         1
1         0
2         0
3         0
4         1

In [14]:
df=pd.read_csv(url,usecols=['Embarked'])

In [19]:
df['Embarked'].unique() # getting the uniques records from the feature

array(['S', 'C', 'Q'], dtype=object)

In [20]:
df.dropna(inplace=True)

In [21]:
pd.get_dummies(df,drop_first=True).head()

   Embarked_Q  Embarked_S
0           0           1
1           0           0
2           0           1
3           0           1
4           0           1

#### Onehotencoding with many categories in a feature

In [22]:
url = 'https://raw.githubusercontent.com/krishnaik06/Feature-Engineering-Live-sessions/master/mercedes.csv'
df = pd.read_csv(url, usecols=["X0","X1","X2","X3","X4","X5","X6"])

In [23]:
df.head()

   X0 X1  X2 X3 X4 X5 X6
0   k  v  at  a  d  u  j
1   k  t  av  e  d  y  l
2  az  w   n  c  d  x  j
3  az  t   n  f  d  x  l
4  az  v   n  f  d  h  d

In [24]:
df['X0'].value_counts()

z     360
ak    349
y     324
ay    313
t     306
x     300
o     269
f     227
n     195
w     182
j     181
az    175
aj    151
s     106
ap    103
h      75
d      73
al     67
v      36
af     35
ai     34
m      34
e      32
ba     27
at     25
a      21
ax     19
am     18
aq     18
i      18
u      17
l      16
aw     16
ad     14
b      11
au     11
k      11
as     10
r      10
bc      6
ao      4
c       3
aa      2
q       2
ac      1
g       1
ab      1
Name: X0, dtype: int64

In [25]:
for i in df.columns:
    print(len(df[i].unique())) # lenght of all unique values present into all the categorical columns

47
27
44
7
4
29
12

count of how much categories are there into the `X1` Feature

In [26]:
df.X1.value_counts().sort_values(ascending=False).head(10)

aa    833
s     598
b     592
l     590
v     408
r     251
i     203
a     143
c     121
o      82
Name: X1, dtype: int64

Taking the top 10 categories present into `X1` in a list

In [27]:
lst_10=df.X1.value_counts().sort_values(ascending=False).head(10).index
lst_10=list(lst_10)

In [29]:
lst_10 # top 10 frequent categories present into the X1

['aa', 's', 'b', 'l', 'v', 'r', 'i', 'a', 'c', 'o']

Applying OneHot Encoding on `lst_10` (top 10 categories)

In [30]:
import numpy as np
for categories in lst_10:
    df[categories]=np.where(df['X1']==categories,1,0)

In [31]:
lst_10.append('X1') # appending the X1 column with it

So here we can see, wherever the category is present it will be **1** else it will be **0**, for e.g.  
for **v** it is showing **1** and in other categories it is showing **0**.

Also for **t** as it is not present into **top 10** its showing **0 everywhere**

In [32]:
df[lst_10]

      aa  s  b  l  v  r  i  a  c  o X1
0      0  0  0  0  1  0  0  0  0  0  v
1      0  0  0  0  0  0  0  0  0  0  t
2      0  0  0  0  0  0  0  0  0  0  w
3      0  0  0  0  0  0  0  0  0  0  t
4      0  0  0  0  1  0  0  0  0  0  v
...   .. .. .. .. .. .. .. .. .. .. ..
4204   0  1  0  0  0  0  0  0  0  0  s
4205   0  0  0  0  0  0  0  0  0  1  o
4206   0  0  0  0  1  0  0  0  0  0  v
4207   0  0  0  0  0  1  0  0  0  0  r
4208   0  0  0  0  0  1  0  0  0  0  r

[4209 rows x 11 columns]